aaron-bond.better-comments
aquasecurityofficial.trivy-vulnerability-scanner
astro-build.astro-vscode
aykutsarac.jsoncrack-vscode
bbenoist.nix
bencoleman.armview
benrogerswpg.transparent-minimap
bierner.github-markdown-preview
bierner.markdown-checkbox
bierner.markdown-emoji
bierner.markdown-footnotes
bierner.markdown-mermaid
bierner.markdown-preview-github-styles
bierner.markdown-yaml-preamble
bradlc.vscode-tailwindcss
captainjinx.kickass-c64
cardinal90.multi-cursor-case-preserve
charliermarsh.ruff
christian-kohler.path-intellisense
connor4312.esbuild-problem-matchers
continue.continue
dbaeumer.vscode-eslint
detachhead.basedpyright
dmitrydorofeev.empty-indent
dnicolson.binary-plist
eamodio.gitlens
editorconfig.editorconfig
esbenp.prettier-vscode
formulahendry.code-runner
foxundermoon.shell-format
fregante.ghost-text
github.copilot
github.copilot-chat
github.vscode-github-actions
golang.go
grapecity.gc-excelviewer
hashicorp.terraform
hediet.vscode-drawio
ibm.output-colorizer
iliaskhairullin.simple-lines-count
jacobpfeifer.pfeifer-hurl
johnnymorganz.stylua
kddejong.vscode-cfn-lint
kevinrose.vsc-python-indent
mads-hartmann.bash-ide-vscode
mikestead.dotenv
ms-azure-devops.azure-pipelines
ms-azuretools.vscode-azureresourcegroups
ms-azuretools.vscode-bicep
ms-azuretools.vscode-docker
ms-dotnettools.vscode-dotnet-runtime
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode.azure-account
ms-vscode.makefile-tools
ms-vscode.powershell
ms-vsliveshare.vsliveshare
msazurermtools.azurerm-vscode-tools
naumovs.color-highlight
noctarya.terminals
perkovec.emoji
pomdtr.excalidraw-editor
rambit.highlight-counter
redhat.vscode-yaml
rid9.datetime
rooveterinaryinc.roo-cline
stevejpurves.cucumber
stkb.rewrap
stoplight.spectral
tamasfe.even-better-toml
teabyii.ayu
teticio.python-envy
tfsec.tfsec
tomoki1207.pdf
unifiedjs.vscode-mdx
visualstudioexptteam.intellicode-api-usage-examples
visualstudioexptteam.vscodeintellicode
wayou.vscode-todo-highlight
wix.vscode-import-cost
