aaron-bond.better-comments
anweber.statusbar-commands
astro-build.astro-vscode
asyrjasalo.based-ayu
aykutsarac.jsoncrack-vscode
bbenoist.nix
benrogerswpg.transparent-minimap
bierner.github-markdown-preview
bierner.markdown-checkbox
bierner.markdown-emoji
bierner.markdown-footnotes
bierner.markdown-mermaid
bierner.markdown-preview-github-styles
bierner.markdown-yaml-preamble
biomejs.biome
bpruitt-goddard.mermaid-markdown-syntax-highlighting
bradlc.vscode-tailwindcss
captainjinx.kickass-c64
cardinal90.multi-cursor-case-preserve
cdervis.vscode-pi
charliermarsh.ruff
christian-kohler.path-intellisense
connor4312.esbuild-problem-matchers
dbaeumer.vscode-eslint
denizhandaklr.glm-chat-provider
denizhandaklr.minimax-vscode
detachhead.basedpyright
dmitrydorofeev.empty-indent
dnicolson.binary-plist
eamodio.gitlens
editorconfig.editorconfig
ethansk.restore-terminals
fabiospampinato.vscode-statusbar-debugger
formulahendry.code-runner
fregante.ghost-text
github.copilot-chat
github.vscode-github-actions
golang.go
grapecity.gc-excelviewer
hashicorp.terraform
hverlin.mise-vscode
ibm.output-colorizer
iliaskhairullin.simple-lines-count
jellydn.vscode-hurl-runner
johnnymorganz.stylua
kddejong.vscode-cfn-lint
kevinrose.vsc-python-indent
mads-hartmann.bash-ide-vscode
mikestead.dotenv
ms-azure-devops.azure-pipelines
ms-azuretools.vscode-bicep
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-dotnettools.vscode-dotnet-runtime
ms-playwright.playwright
ms-python.debugpy
ms-python.python
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode.powershell
ms-vsliveshare.vsliveshare
naumovs.color-highlight
nick-rudenko.back-n-forth
pcassidy75.tmux-integrated
perkovec.emoji
pomdtr.excalidraw-editor
rambit.highlight-counter
redhat.vscode-yaml
rid9.datetime
rust-lang.rust-analyzer
rvben.rumdl
ryanreynolds.agent-terminal
shahilkumar.docxreader
stevejpurves.cucumber
stkb.rewrap
stoplight.spectral
tamasfe.even-better-toml
tekumara.typos-vscode
tomoki1207.pdf
unifiedjs.vscode-mdx
usernamehw.errorlens
wayou.vscode-todo-highlight
wix.vscode-import-cost
yutengjing.open-in-external-app
