aaron-bond.better-comments
adpyke.codesnap
aquasecurityofficial.trivy-vulnerability-scanner
aykutsarac.jsoncrack-vscode
bbenoist.nix
bencoleman.armview
bierner.github-markdown-preview
bierner.markdown-checkbox
bierner.markdown-emoji
bierner.markdown-footnotes
bierner.markdown-mermaid
bierner.markdown-preview-github-styles
bierner.markdown-yaml-preamble
bradlc.vscode-tailwindcss
captainjinx.kickass-c64
charliermarsh.ruff
christian-kohler.path-intellisense
codeium.codeium
continue.continue
dbaeumer.vscode-eslint
dnicolson.binary-plist
eamodio.gitlens
editorconfig.editorconfig
esbenp.prettier-vscode
exiasr.hadolint
formulahendry.auto-close-tag
formulahendry.auto-rename-tag
foxundermoon.shell-format
fregante.ghost-text
golang.go
gruntfuggly.activitusbar
hashicorp.terraform
hediet.vscode-drawio
humao.rest-client
ibm.output-colorizer
kddejong.vscode-cfn-lint
mads-hartmann.bash-ide-vscode
mikestead.dotenv
ms-azure-devops.azure-pipelines
ms-azuretools.vscode-bicep
ms-azuretools.vscode-docker
ms-dotnettools.vscode-dotnet-runtime
ms-pyright.pyright
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode.azure-account
ms-vscode.makefile-tools
ms-vscode.powershell
ms-vsliveshare.vsliveshare
msazurermtools.azurerm-vscode-tools
naumovs.color-highlight
perkovec.emoji
rambit.highlight-counter
redhat.vscode-yaml
semgrep.semgrep
stevejpurves.cucumber
stkb.rewrap
stoplight.spectral
streetsidesoftware.code-spell-checker
tamasfe.even-better-toml
teabyii.ayu
tfsec.tfsec
tomoki1207.pdf
visualstudioexptteam.intellicode-api-usage-examples
visualstudioexptteam.vscodeintellicode
wayou.vscode-todo-highlight
wix.vscode-import-cost
