{
  "mcpServers": {
    "context7": {
      "description": "Use when you need up-to-date, version-specific documentation and code samples for libraries, frameworks, or APIs. Ideal for getting accurate implementation details when working with packages that may have outdated training data, or when you need to understand current API usage patterns with real code examples from the source.",
      "type": "http",
      "url": "https://mcp.context7.com/mcp",
      "headers": {
        "CONTEXT7_API_KEY": "${CONTEXT7_API_KEY}"
      }
    },
    "gh-grep": {
      "description": "Use when you need to find real-world code examples from GitHub repositories. Ideal for understanding how libraries are actually used in production code, finding implementation patterns, searching for specific code snippets across millions of repositories, or learning best practices from real codebases. Search for literal code patterns, not keywords.",
      "type": "http",
      "url": "https://mcp.grep.app"
    },
    "exa": {
      "description": "Use for specialized domain searches with neural/semantic search capabilities. Ideal for: academic paper searches, LinkedIn professional networking searches, GitHub code repository searches, company research and business intelligence, Wikipedia lookups, and finding specific content types (code snippets, documentation, professional profiles). Choose Exa when you need to search within specialized domains or platforms rather than general web content.",
      "type": "http",
      "url": "https://mcp.exa.ai/mcp"
    },
    "skillseeker": {
      "description": "Convert documentation websites, GitHub repositories, and PDFs into AI skills/knowledge bases. Ideal for: scraping documentation sites, analyzing code repositories with AST parsing, extracting content from PDFs, generating .cursorrules/.windsurfrules for AI coding assistants, creating Claude Code skills, building RAG pipeline data for LangChain/LlamaIndex/Pinecone, detecting conflicts between documentation and code implementation, and packaging knowledge into uploadable formats for Claude, Gemini, or OpenAI.",
      "command": "uvx",
      "args": [
        "--from",
        "skill-seekers[mcp]",
        "python",
        "-m",
        "skill_seekers.mcp.server_fastmcp"
      ]
    }
  }
}
