{
  "mcpServers": {
    "context7": {
      "description": "Use when you need up-to-date, version-specific documentation and code samples for libraries, frameworks, or APIs. Ideal for getting accurate implementation details when working with packages that may have outdated training data, or when you need to understand current API usage patterns with real code examples from the source.",
      "headers": {
        "CONTEXT7_API_KEY": "${CONTEXT7_API_KEY}"
      },
      "type": "http",
      "url": "https://mcp.context7.com/mcp"
    },
    "gh-grep": {
      "description": "Use when you need to find real-world code examples from GitHub repositories. Ideal for understanding how libraries are actually used in production code, finding implementation patterns, searching for specific code snippets across millions of repositories, or learning best practices from real codebases. Search for literal code patterns, not keywords.",
      "type": "http",
      "url": "https://mcp.grep.app"
    },
    "tavily": {
      "description": "Use for real-time web search, fact-checking, current events, research, and extracting structured data from web pages. Ideal when you need fresh information not in training data, want to crawl or map website structures, or need intelligent data extraction from multiple web sources. Provides high-quality, factual search results optimized for AI agents.",
      "type": "http",
      "url": "https://mcp.tavily.com/mcp/?tavilyApiKey=${TAVILY_API_KEY}"
    },
    "utcp": {
      "args": [
        "-y",
        "@utcp/code-mode-mcp"
      ],
      "command": "npx",
      "description": "Use when you need to execute complex logic involving multiple tool calls, filter or process data before sending to the model, or reduce token usage by batching operations. Enables code execution mode where the agent writes TypeScript scripts that call MCP tools directly, reducing context overhead by up to 98.7% and allowing more efficient tool orchestration.",
      "type": "stdio"
    }
  }
}
